[
  {
    "title": "The Transcenders",
    "imageSrc": "projects/TheTranscenders.png",
    "description": "I refined my frontend skills by building responsive and interactive interfaces from scratch. I learned how to handle dynamic updates and create a smooth, user-friendly experience. This project also sharpened my problem-solving skills by pushing me to optimize performance.",
    "skills": ["Bootstrap", "CSS", "JS", "HTML"],
    "demo": "assets/projects/TheTranscenders.mp4",
    "source": "https://github.com/SimosTigkas/TheTranscenders"
  },
  {
    "title": "UI-Design Training",
    "imageSrc": "projects/UiDesignTraining.png",
    "description": "I created functional and visually appealing user interfaces by using HTML, CSS and by having the core UI design principles in mind. I built responsive layouts with images and adaptive navigation, while enhancing interactivity through subtle shadows gradients and animations.",
    "skills": ["CSS", "HTML", "JS"],
    "demo": "assets/projects/UiDesignTraining.mp4",
    "source": "https://github.com/SimosTigkas/UI-Design-training"
  },
  {
    "title": "Smartwatch Landing Page",
    "imageSrc": "projects/FigmaEssentials.png",
    "description": "Designed in Figma, focusing on visual hierarchy, usability and responsive design. This project shows mastery of UI and UX principles through the thoughtful structure of layout, consistent typography and engaging color palette. The emphasis is on clarity, conversion and an appealing product.",
    "skills": ["UX", "UI", "Figma"],
    "demo": "assets/projects/FigmaEssentials.mp4",
    "source": "https://www.figma.com/site/AD3N3dyidE3WOMvj2ZPGCS/Simos-Smart-Watches?node-id=20-435&t=jdePEalJFq4lXyZy-0"
  },
  {
    "title": "2D Fractals",
    "imageSrc": "projects/fractals.png",
    "description": "In this project I created mesmerizing fractals, including the Julia set, the Mandelbrot set and the Burning Ship set. Additionally, it allowed me to combine mathematics with computer graphics and develop a deeper appreciation for visual programming.",
    "skills": ["C", "Makefile", "Graphics"],
    "demo": "assets/projects/Fractals.mp4",
    "source": "https://github.com/SimosTigkas/2D-Fractals"
  }
]